# 1. Введение в Python - intro.py (5%)
# Установите Python и настройте среду разработки (например, PyCharm, VS Code).
# Напишите программу, которая выводит на экран текст "Hello, World!".
# Напишите программу, которая запрашивает у пользователя его имя и выводит приветствие, например: "Привет, [имя]!".

# -----------------------------_1_-----------------------------
print("Hello, World!")

# -----------------------------_2_-----------------------------
a = input("Your Name: ")
print(f"Hello, {a}")